OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/C8051F920.h
/*-------------------------------------------------------------------------
   C8051F920.h -Register Declarations for the SiLabs C8051F92x-93x
   Processor Range

   Copyright (C) 2009, Steven Borley, steven.borley@partnerelectronics.com

   This library is free software; you can redistribute it and/or modify it
   under the terms of the GNU General Public License as published by the
   Free Software Foundation; either version 2, or (at your option) any
   later version.

   This library is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License 
   along with this library; see the file COPYING. If not, write to the
   Free Software Foundation, 51 Franklin Street, Fifth Floor, Boston,
   MA 02110-1301, USA.

   As a special exception, if you link this library with other files,
   some of which are compiled with SDCC, to produce an executable,
   this library does not by itself cause the resulting executable to
   be covered by the GNU General Public License. This exception does
   not however invalidate any other reasons why the executable file
   might be covered by the GNU General Public License.
-------------------------------------------------------------------------*/

#ifndef C8051F920_H
#define C8051F920_H

#include <compiler.h>


/*  BYTE Registers  */

/* Page 0x00 (and all pages) */
SFR(       P0, 0x80 )  ; /* PORT 0 */
SFR(       SP, 0x81 )  ; /* STACK POINTER */
SFR(      DPL, 0x82 )  ; /* DATA POINTER - LOW BYTE */
SFR(      DPH, 0x83 )  ; /* DATA POINTER - HIGH BYTE */
SFR(  SPI1CFG, 0x84 )  ; /* SPI1 Configuration */
SFR(  SPI1CKR, 0x85 )  ; /* SPI1 Clock Rate Control */
SFR(  SPI1DAT, 0x86 )  ; /* SPI1 Data */
SFR(     PCON, 0x87 )  ; /* POWER CONTROL */
SFR(     TCON, 0x88 )  ; /* TIMER CONTROL */
SFR(     TMOD, 0x89 )  ; /* TIMER MODE */
SFR(      TL0, 0x8A )  ; /* TIMER 0 - LOW BYTE */
SFR(      TL1, 0x8B )  ; /* TIMER 1 - LOW BYTE */
SFR(      TH0, 0x8C )  ; /* TIMER 0 - HIGH BYTE */
SFR(      TH1, 0x8D )  ; /* TIMER 1 - HIGH BYTE */
SFR(    CKCON, 0x8E )  ; /* CLOCK CONTROL */
SFR(    PSCTL, 0x8F )  ; /* Program Store R/W Control */
SFR(       P1, 0x90 )  ; /* PORT 1 */
SFR(   TMR3CN, 0x91 )  ; /* TIMER 3 CONTROL */
SFR(  TMR3RLL, 0x92 )  ; /* TIMER 3 CAPTURE REGISTER - LOW BYTE */
SFR(  TMR3RLH, 0x93 )  ; /* TIMER 3 CAPTURE REGISTER - HIGH BYTE */
SFR(    TMR3L, 0x94 )  ; /* TIMER 3 - LOW BYTE */
SFR(    TMR3H, 0x95 )  ; /* TIMER 3 - HIGH BYTE */
SFR(    DC0CF, 0x96 )  ; /* DC0 (DC-DC Converter) Configuration  */
SFR(    DC0CN, 0x97 )  ; /* DC0 (DC-DC Converter) Control  */
SFR(    SCON0, 0x98 )  ; /* Serial Port Control */
SFR(    SBUF0, 0x99 )  ; /* Serial Port Buffer */
SFR(   CPT1CN, 0x9A )  ; /* Comparator 1 Control  */
SFR(   CPT0CN, 0x9B )  ; /* Comparator 0 Control  */
SFR(   CPT1MD, 0x9C )  ; /* Comparator 1 Mode Selection  */
SFR(   CPT0MD, 0x9D )  ; /* Comparator 0 Mode Selection */
SFR(   CPT1MX, 0x9E )  ; /* Comparator 1 mux selection */
SFR(   CPT0MX, 0x9F )  ; /* Comparator 0 mux selection */
SFR(       P2, 0xA0 )  ; /* PORT 2 */
SFR(  SPI0CFG, 0xA1 )  ; /* SPI0 CONFIGURATION */
SFR(  SPI0CKR, 0xA2 )  ; /* SPI0 Clock Rate Control */
SFR(  SPI0DAT, 0xA3 )  ; /* SPI0 Data */
SFR(  P0MDOUT, 0xA4 )  ; /* PORT 0 OUTPUT MODE CONFIGURATION */
SFR(  P1MDOUT, 0xA5 )  ; /* PORT 1 OUTPUT MODE CONFIGURATION */
SFR(  P2MDOUT, 0xA6 )  ; /* PORT 2 OUTPUT MODE CONFIGURATION */
SFR(  SFRPAGE, 0xA7 )  ; /* SFR Page */
SFR(       IE, 0xA8 )  ; /* INTERRUPT ENABLE */
SFR(   CLKSEL, 0xA9 )  ; /* SYSTEM CLOCK SELECT */
SFR(   EMI0CN, 0xAA )  ; /* EMIF Control */
SFR(   _XPAGE, 0xAA )  ; /* XDATA/PDATA page alias for SDCC */
SFR(   EMI0CF, 0xAB )  ; /* EMIF Configuration  */
SFR(  RTC0ADR, 0xAC )  ; /* RTC0 Address  */
SFR(  RTC0DAT, 0xAD )  ; /* RTC0 Data */
SFR(  RTC0KEY, 0xAE )  ; /* RTC0 Key */
SFR(   EMI0TC, 0xAF )  ; /* EMIF Timing Control */
SFR(   SPI1CN, 0xB0 )  ; /* SPI1 Control  */
SFR(   OSCXCN, 0xB1 )  ; /* EXTERNAL OSCILLATOR CONTROL */
SFR(   OSCICN, 0xB2 )  ; /* INTERNAL OSCILLATOR CONTROL */
SFR(   OSCICL, 0xB3 )  ; /* INTERNAL OSCILLATOR CALIBRATION */
SFR(   PMU0CF, 0xB5 )  ; /* PMU0 Configuration */
SFR(    FLSCL, 0xB6 )  ; /* IFlash Scale  */
SFR(    FLKEY, 0xB7 )  ; /* Flash Lock And Key */
SFR(       IP, 0xB8 )  ; /* INTERRUPT PRIORITY */
SFR(  IREF0CN, 0xB9 )  ; /* Current Reference IREF Control  */
SFR(   ADC0AC, 0xBA )  ; /* ADC0 Accumulator Configuration  */
SFR(   ADC0MX, 0xBB )  ; /* AMUX0 Channel Select  */
SFR(   ADC0CF, 0xBC )  ; /* ADC 0 CONFIGURATION */
SFR(    ADC0L, 0xBD )  ; /* ADC 0 DATA - LOW BYTE */
SFR(    ADC0H, 0xBE )  ; /* ADC 0 DATA - HIGH BYTE */
SFR(   P1MASK, 0xBF )  ; /* Port 1 Mask */
SFR(   SMB0CN, 0xC0 )  ; /* SMBUS CONTROL */
SFR(   SMB0CF, 0xC1 )  ; /* SMBUS CONFIGURATION */
SFR(  SMB0DAT, 0xC2 )  ; /* SMBUS DATA */
SFR(  ADC0GTL, 0xC3 )  ; /* ADC 0 GREATER-THAN REGISTER - LOW BYTE */
SFR(  ADC0GTH, 0xC4 )  ; /* ADC 0 GREATER-THAN REGISTER - HIGH BYTE */
SFR(  ADC0LTL, 0xC5 )  ; /* ADC 0 LESS-THAN REGISTER - LOW BYTE */
SFR(  ADC0LTH, 0xC6 )  ; /* ADC 0 LESS-THAN REGISTER - HIGH BYTE */
SFR(   P0MASK, 0xC7 )  ; /* Port 0 Mask */
SFR(   TMR2CN, 0xC8 )  ; /* Timer 2 control  */
SFR(   REG0CN, 0xC9 )  ; /* Voltage Regulator (VREG0) Control */
SFR(  TMR2RLL, 0xCA )  ; /* Timer 2 capture register - low byte  */
SFR(  TMR2RLH, 0xCB )  ; /* Timer 2 capture register - high byte */
SFR(    TMR2L, 0xCC )  ; /* Timer 2 - low byte*/
SFR(    TMR2H, 0xCD )  ; /* Timer 2 - high byte */
SFR( PCA0CPM5, 0xCE )  ; /* PCA0 Module 5 Mode Register  */
SFR(    P1MAT, 0xCF )  ; /* Port 1 Match  */
SFR(      PSW, 0xD0 )  ; /* PROGRAM STATUS WORD */
SFR(   REF0CN, 0xD1 )  ; /* VOLTAGE REFERENCE 0 CONTROL */
SFR( PCA0CPL5, 0xD2 )  ; /* PCA0 Capture 5 Low */
SFR( PCA0CPH5, 0xD3 )  ; /* PCA0 Capture 5 High */
SFR(   P0SKIP, 0xD4 )  ; /* PORT 0 SKIP */
SFR(   P1SKIP, 0xD5 )  ; /* PORT 1 SKIP */
SFR(   P2SKIP, 0xD6 )  ; /* PORT 2 SKIP */
SFR(    P0MAT, 0xD7 )  ; /* Port 0 Match */
SFR(   PCA0CN, 0xD8 )  ; /* PCA CONTROL */
SFR(   PCA0MD, 0xD9 )  ; /* PCA MODE */
SFR( PCA0CPM0, 0xDA )  ; /* PCA0 Module 0 Mode Register */
SFR( PCA0CPM1, 0xDB )  ; /* PCA0 Module 1 Mode Register */
SFR( PCA0CPM2, 0xDC )  ; /* PCA0 Module 2 Mode Register  */
SFR( PCA0CPM3, 0xDD )  ; /* PCA0 Module 3 Mode Register */
SFR( PCA0CPM4, 0xDE )  ; /* PCA0 Module 4 Mode Register  */
SFR(  PCA0PWM, 0xDF )  ; /* PCA0 PWM Configuration  */
SFR(      ACC, 0xE0 )  ; /* ACCUMULATOR */
SFR(     XBR0, 0xE1 )  ; /* Port Mux Configuration Register 0 */
SFR(     XBR1, 0xE2 )  ; /* Port Mux Configuration Register 1 */
SFR(     XBR2, 0xE3 )  ; /* Port Mux Configuration Register 2 */
SFR(  INT01CF, 0xE4 )  ; /* INT0/INT1 Configuration Register */
SFR(     EIE1, 0xE6 )  ; /* EXTERNAL INTERRUPT ENABLE 1 */
SFR(     EIE2, 0xE7 )  ; /* EXTERNAL INTERRUPT ENABLE 2 */
SFR(   ADC0CN, 0xE8 )  ; /* ADC 0 CONTROL */
SFR( PCA0CPL1, 0xE9 )  ; /* PCA CAPTURE 1 LOW */
SFR( PCA0CPH1, 0xEA )  ; /* PCA CAPTURE 1 HIGH */
SFR( PCA0CPL2, 0xEB )  ; /* PCA CAPTURE 2 LOW */
SFR( PCA0CPH2, 0xEC )  ; /* PCA CAPTURE 2 HIGH */
SFR( PCA0CPL3, 0xED )  ; /* PCA0 Capture 3 Low */
SFR( PCA0CPH3, 0xEE )  ; /* PCA0 Capture 3 High */
SFR(   RSTSRC, 0xEF )  ; /* RESET SOURCE */
SFR(        B, 0xF0 )  ; /* B REGISTER */
SFR(   P0MDIN, 0xF1 )  ; /* Port 0 Input Mode Configuration */
SFR(   P1MDIN, 0xF2 )  ; /* Port 1 Input Mode Configuration  */
SFR(   P2MDIN, 0xF3 )  ; /* Port 2 Input Mode Configuration  */
SFR(  SMB0ADR, 0xF4 )  ; /* SMBus Slave Address */
SFR(  SMB0ADM, 0xF5 )  ; /* SMBus Slave Address Mask  */
SFR(     EIP1, 0xF6 )  ; /* EXTERNAL INTERRUPT PRIORITY REGISTER 1 */
SFR(     EIP2, 0xF7 )  ; /* EXTERNAL INTERRUPT PRIORITY REGISTER 2 */
SFR(   SPI0CN, 0xF8 )  ; /* SPI0 Control  */
SFR(    PCA0L, 0xF9 )  ; /* PCA COUNTER LOW */
SFR(    PCA0H, 0xFA )  ; /* PCA COUNTER HIGH */
SFR( PCA0CPL0, 0xFB )  ; /* PCA CAPTURE 0 LOW */
SFR( PCA0CPH0, 0xFC )  ; /* PCA CAPTURE 0 HIGH */
SFR( PCA0CPL4, 0xFD )  ; /* PCA0 Capture 4 Low */
SFR( PCA0CPH4, 0xFE )  ; /* PCA0 Capture 4 High */
SFR(   VDM0CN, 0xFF )  ; /* VDD Monitor Control */

