OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/include/mcs51/C8051F920.h
/*  SPI0CN  0xF8 */
SBIT(   SPI0EN, 0xF8, 0 )  ; /* SPI0 Enable */
SBIT(   TXBMT0, 0xF8, 1 )  ; /* SPI0 Transmit Buffer Empty */
SBIT(  NSS0MD0, 0xF8, 2 )  ; /* SPI0 Slave Select Mode bit-0 */
SBIT(  NSS0MD1, 0xF8, 3 )  ; /* SPI0 Slave Select Mode bit-1 */
SBIT(  RXOVRN0, 0xF8, 4 )  ; /* SPI0 Receive Overrun Flag */
SBIT(    MODF0, 0xF8, 5 )  ; /* SPI0 Mode Fault Flag */
SBIT(    WCOL0, 0xF8, 6 )  ; /* SPI0 Write Collision Flag */
SBIT(    SPIF0, 0xF8, 7 )  ; /* SPI0 Interrupt Flag */


/* Indirectly accessed registers */

/* smaRTClock Internal Registers */
#define CAPTURE0         0x00    /* smaRTClock Capture register 0 */
#define CAPTURE1         0x01    /* smaRTClock Capture register 1 */
#define CAPTURE2         0x02    /* smaRTClock Capture register 2 */
#define CAPTURE3         0x03    /* smaRTClock Capture register 3 */
#define RTC0CN           0x04    /* smaRTClock Control */
#define RTC0XCN          0x05    /* smaRTClock Oscillator Control */
#define RTC0XCF          0x06    /* smaRTClock Oscillator Configuration */
#define RTC0PIN          0x07    /* smaRTClock Pin Configuration */
#define ALARM0           0x08    /* smaRTClock Alarm Register 0 */
#define ALARM1           0x09    /* smaRTClock Alarm Register 1 */
#define ALARM2           0x0A    /* smaRTClock Alarm Register 2 */
#define ALARM3           0x0B    /* smaRTClock Alarm Register 3 */


/* Predefined SFR Bit Masks */

/* PCON 0x87 */
#define PCON_IDLE       (1<<0)    /* PCON                                */
#define PCON_STOP       (1<<1)    /* PCON                                */

/* CKON 0x8E  */
#define T0M             (1<<2)    /* CKCON  Timer 0 Clock Select         */
#define T1M             (1<<3)    /* CKCON  Timer 1 Clock Select         */

/* PSCTL 0x8F */
#define PSWE            (1<<0)    /* Program Store Write Enable          */
#define PSEE            (1<<1)    /* Program Store Erase Enable          */
#define SFLE            (1<<2)    /* Scratchpad Flash Access Enable      */

/* EIE1 0xE6 */
#define ESMB0           (1<<0)    /* Enable SMBus (SMB0) Interrupt       */
#define ERTC0A          (1<<1)    /* Enable smaRTClock Alarm Interrupts  */
#define EWADC0          (1<<2)    /* Enable Window Comparison ADC0 Int.  */
#define EADC0           (1<<3)    /* Enable ADC0 Convert Complete Int.   */
#define EPCA0           (1<<4)    /* Enable PCA0 Interrupt               */
#define ECP0            (1<<5)    /* Enable Comparator0 (CP0) Interrupt  */
#define ECP1            (1<<6)    /* Enable Comparator1 (CP1) Interrupt  */
#define ET3             (1<<7)    /* Enable Timer 3 Interrupt            */

/* RSTSRC */
#define PINRSF          (1<<0)    /* HW Pin Reset Flag                   */
#define PORSF           (1<<1)    /* Power-on/fail Reset Rlag            */
#define MCDRSF          (1<<2)    /* Missing Clock Detector Reset Rlag   */
#define WDTRSF          (1<<3)    /* Watchdog Timer Reset Rlag           */
#define SWRSF           (1<<4)    /* Software Force/Reset Rlag           */
#define C0RSEF          (1<<5)    /* Comparator0 Reset Rlag              */
#define FERROR          (1<<6)    /* Flash Error Reset Rlag              */
#define RTC0RE          (1<<7)    /* smaRTClock Reset Rlag               */

/* PCA0CPMn */
#define ECCF            (1<<0)    /* Capture/Compare Flag Interrupt En.  */
#define PWM             (1<<1)    /* Pulse Width Modulation Mode Enable  */
#define TOG             (1<<2)    /* Toggle Function Enable              */
#define MAT             (1<<3)    /* Match Function Enable               */
#define CAPN            (1<<4)    /* Capture Negative Function Enable    */
#define CAPP            (1<<5)    /* Capture Positive Function Enable.   */
#define ECOM            (1<<6)    /* Comparator Function Enable.         */
#define PWM16           (1<<7)    /* 16-bit Pulse Width Modulation Enable*/

/* XBR0 0xE1 */
#define URT0E           (1<<0)    /* UART0 I/O enable                    */
#define SPI0E           (1<<1)    /* SPI0 I/O Enable                     */
#define SMB0E           (1<<2)    /* SMBus I/O Enable                    */
#define SYSCKE          (1<<3)    /* SYSCLK Output Enable.               */
#define CP0E            (1<<4)    /* Comparator0 Output Enable           */
#define CP0AE           (1<<5)    /* Comparator0 Asynchronous Output En. */
#define CP1E            (1<<6)    /* Comparator1 Output Enable           */
#define CP1AE           (1<<7)    /* Comparator1 Asynchronous Output En. */

/* XBR1 0xE2 */
#define PCA0ME0         (1<<0)    /* PCA0 Module I/O Enable bit-0        */
#define PCA0ME1         (1<<1)    /* PCA0 Module I/O Enable bit-1        */
#define PCA0ME2         (1<<2)    /* PCA0 Module I/O Enable bit-2        */
#define ECIE            (1<<3)    /* PCA0 Ext. Counter Input Enable      */
#define T0E             (1<<4)    /* Timer0 Input Enable                 */
#define T1E             (1<<5)    /* Timer1 Input Enable                 */
#define SPI1E           (1<<6)    /* SPI1 I/O Enable                     */

/* XBR2 0xE3 */
#define XBARE           (1<<6)    /* Crossbar Enable                     */
#define WEAKPUD         (1<<7)    /* Port I/O Weak Pullup Disable        */

/* Interrupts */

#define INT_EXT0          0       /* External Interrupt 0*/
#define INT_TIMER0        1       /* Timer0 Overflow */
#define INT_EXT1          2       /* External Interrupt 1 */
#define INT_TIMER1        3       /* Timer1 Overflow */
#define INT_UART0         4       /* Serial Port 0 */
#define INT_TIMER2        5       /* Timer2 Overflow */
#define INT_SPI0          6       /* SPI0 */
#define INT_SMBUS0        7       /* SMBus0 Interface */
#define INT_ALARM         8       /* smaRTClock Alarm  */
#define INT_ADC0_WINDOW   9       /* ADC0 Window Comparison */
#define INT_ADC0_EOC     10       /* ADC0 End Of Conversion */
#define INT_PCA0         11       /* PCA0 Peripheral */
#define INT_CP0          12       /* Comparator 0 */
#define INT_CP1          13       /* Comparator 1 */
#define INT_TIMER3       14       /* Timer3 Overflow */
#define INT_VWARN        15       /* VDD/DC+ Supply Monitor early warning */
#define INT_MATCH        16       /* Port Match */
#define INT_OSCFAIL      17       /* smaRTClock Oscillator Fail */
#define INT_SPI1         18       /* SPI1 */

/* aliases - these map alternative names to names use in the datasheet */
#define SCON             SCON0    /* Serial Port Control */
#define SBUF             SBUF0    /* Serial Port Buffer */
#define T2CON            TMR2CN	  /* Timer 2 control */
#define RCAP2            TMR2RL   /* Timer 2 capture register word */
#define RCAP2L           TMR2RLL  /* Timer 2 capture register - low byte */
#define RCAP2H           TMR2RLH  /* Timer 2 capture register - high byte */
#define T2               TMR2     /* Timer 2 - word */
#define TL2              TMR2L    /* Timer 2 - low byte */
#define TH2              TMR2H    /* Timer 2 - high byte */
#define PRT0MX           XBR0     /* Port Mux Configuration Register 0 */
#define PRT1MX           XBR1	  /* Port Mux Configuration Register 1 */
#define PRT2MX           XBR2	  /* Port Mux Configuration Register 2 */
#define IT01CF           INT01CF  /* INT0/INT1 Configuration Register */
#define P0MODE           P0MDIN   /* Port 0 Input Mode Configuration */
#define P1MODE           P1MDIN   /* Port 1 Input Mode Configuration */
#define P2MODE           P2MDIN   /* Port 2 Input Mode Configuration */
#define CP0OEN           CP0E     /* Comparator 0 Output Enable bit */
#define CP0AOEN          CP0AE    /* Comparator 0 Asynchronous Output En. bit */


#endif /* C8051F920_H */
